<!-- terraform-plan-comment:root:default -->
### Terraform Plan

<details><summary>🟢 <strong>create</strong> <code>0</code> · 🟡 <strong>update</strong> <code>5</code> · 🔴 <strong>destroy</strong> <code>0</code></summary>

<details><summary>State refresh</summary>

```
random_id.suffix: Refreshing state... [id=SDmmTw]
data.archive_file.page_generator_zip: Reading...
data.archive_file.lambda_zip: Reading...
data.archive_file.page_generator_zip: Read complete after 0s [id=25d2360d8e846156f2f17e7a0556b4c280d0b899]
data.archive_file.lambda_zip: Read complete after 0s [id=5ecf306f8a9aa6ef4a1605e393d1e35b83fc2b99]
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::628639830692:oidc-provider/token.actions.githubusercontent.com]
data.aws_cloudfront_cache_policy.caching_optimized: Reading...
aws_route53_zone.main: Refreshing state... [id=Z02196392OCM77HDMQZC7]
aws_cloudfront_function.www_redirect: Refreshing state... [id=bruce-quotes-www-redirect]
aws_acm_certificate.api: Refreshing state... [id=arn:aws:acm:us-east-2:628639830692:certificate/fcd00a28-eb73-45bf-b11f-8e658d04566a]
data.aws_cloudfront_response_headers_policy.security: Reading...
aws_cloudfront_origin_access_control.site: Refreshing state... [id=E362GSXPUAZ3M6]
aws_s3_bucket.site: Refreshing state... [id=bruce-quotes-site-4839a64f]
aws_dynamodb_table.quotes: Refreshing state... [id=bruce-quotes]
data.aws_cloudfront_origin_request_policy.cors_s3_origin: Reading...
aws_apigatewayv2_api.http_api: Refreshing state... [id=ijed2skzy9]
aws_iam_role.lambda_exec: Refreshing state... [id=bruce-quotes-lambda-exec]
aws_iam_role.page_generator_exec: Refreshing state... [id=bruce-quotes-page-generator-exec]
data.aws_cloudfront_response_headers_policy.security: Read complete after 0s [id=67f7725c-6f97-4210-82d7-5512b31e9d03]
data.aws_cloudfront_cache_policy.caching_optimized: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
aws_iam_role.github_terraform_apply: Refreshing state... [id=bruce-quotes-github-terraform-apply]
aws_acm_certificate.cf: Refreshing state... [id=arn:aws:acm:us-east-1:628639830692:certificate/50c4b402-2aa2-4e14-8950-392f25254474]
data.aws_cloudfront_origin_request_policy.cors_s3_origin: Read complete after 0s [id=88a5eaf4-2fd4-4709-b370-b4c650ea3fcf]
aws_iam_role.github_terraform_plan: Refreshing state... [id=bruce-quotes-github-terraform-plan]
aws_iam_policy.ddb_access: Refreshing state... [id=arn:aws:iam::628639830692:policy/bruce-quotes-ddb-access]
aws_route53_record.api_validation["api.shitbrucesays.co.uk"]: Refreshing state... [id=Z02196392OCM77HDMQZC7__bebc934a45fa942b0df090b700ce79c4.api.shitbrucesays.co.uk._CNAME]
aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=bruce-quotes-lambda-exec/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_lambda_function.api: Refreshing state... [id=bruce-quotes-api]
aws_iam_role_policy_attachment.page_generator_basic: Refreshing state... [id=bruce-quotes-page-generator-exec/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_iam_role_policy_attachment.ddb_to_lambda: Refreshing state... [id=bruce-quotes-lambda-exec/arn:aws:iam::628639830692:policy/bruce-quotes-ddb-access]
aws_acm_certificate_validation.api: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_iam_role_policy.github_terraform_apply: Refreshing state... [id=bruce-quotes-github-terraform-apply:terraform-apply-permissions]
aws_iam_role_policy.github_terraform_plan: Refreshing state... [id=bruce-quotes-github-terraform-plan:terraform-plan-permissions]
aws_route53_record.cf_validation["www.shitbrucesays.co.uk"]: Refreshing state... [id=Z02196392OCM77HDMQZC7__7e712fa0335addbfc9c83b37781bae5a.www.shitbrucesays.co.uk._CNAME]
aws_route53_record.cf_validation["shitbrucesays.co.uk"]: Refreshing state... [id=Z02196392OCM77HDMQZC7__d627e24d7f5c6061d4a1173b065ef389.shitbrucesays.co.uk._CNAME]
aws_s3_object.js: Refreshing state... [id=bruce-quotes-site-4839a64f/app.js]
aws_iam_policy.page_generator_access: Refreshing state... [id=arn:aws:iam::628639830692:policy/bruce-quotes-page-generator-access]
aws_s3_bucket_versioning.site: Refreshing state... [id=bruce-quotes-site-4839a64f]
aws_s3_object.css: Refreshing state... [id=bruce-quotes-site-4839a64f/styles.css]
aws_lambda_function.page_generator: Refreshing state... [id=bruce-quotes-page-generator]
aws_s3_object.robots: Refreshing state... [id=bruce-quotes-site-4839a64f/robots.txt]
aws_s3_object.favicon: Refreshing state... [id=bruce-quotes-site-4839a64f/favicon.svg]
aws_s3_bucket_lifecycle_configuration.site: Refreshing state... [id=bruce-quotes-site-4839a64f]
aws_s3_bucket_public_access_block.site: Refreshing state... [id=bruce-quotes-site-4839a64f]
aws_s3_bucket_ownership_controls.site: Refreshing state... [id=bruce-quotes-site-4839a64f]
aws_apigatewayv2_domain_name.api: Refreshing state... [id=api.shitbrucesays.co.uk]
aws_iam_role_policy_attachment.page_generator_access: Refreshing state... [id=bruce-quotes-page-generator-exec/arn:aws:iam::628639830692:policy/bruce-quotes-page-generator-access]
aws_acm_certificate_validation.cf: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_lambda_permission.api_invoke: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=01j05f6]
aws_lambda_event_source_mapping.dynamodb_stream: Refreshing state... [id=2c115c0d-9b51-4a45-8fd2-6603a51c9ea2]
aws_apigatewayv2_api_mapping.api: Refreshing state... [id=uwchwi]
aws_route53_record.api: Refreshing state... [id=Z02196392OCM77HDMQZC7_api_A]
aws_s3_object.index: Refreshing state... [id=bruce-quotes-site-4839a64f/index.html]
aws_cloudfront_distribution.site: Refreshing state... [id=E2T928B9V6ESU6]
aws_apigatewayv2_route.quotes["options"]: Refreshing state... [id=0azycx0]
aws_apigatewayv2_route.quotes["get"]: Refreshing state... [id=iuscaoi]
aws_apigatewayv2_route.quotes["post"]: Refreshing state... [id=o7t50z8]
aws_route53_record.www_aaaa: Refreshing state... [id=Z02196392OCM77HDMQZC7_www.shitbrucesays.co.uk_AAAA]
aws_route53_record.apex_aaaa: Refreshing state... [id=Z02196392OCM77HDMQZC7_shitbrucesays.co.uk_AAAA]
aws_route53_record.apex_a: Refreshing state... [id=Z02196392OCM77HDMQZC7_shitbrucesays.co.uk_A]
aws_route53_record.www_a: Refreshing state... [id=Z02196392OCM77HDMQZC7_www.shitbrucesays.co.uk_A]
aws_s3_bucket_policy.site_cf: Refreshing state... [id=bruce-quotes-site-4839a64f]
```
</details>

```terraform
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.site_allow_cf will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "site_allow_cf" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::bruce-quotes-site-4839a64f/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::628639830692:distribution/E2T928B9V6ESU6",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_apigatewayv2_api.http_api will be updated in-place
  ~ resource "aws_apigatewayv2_api" "http_api" {
        id                           = "ijed2skzy9"
        name                         = "bruce-quotes-api"
        tags                         = {}
        # (12 unchanged attributes hidden)

      ~ cors_configuration {
          ~ max_age           = 3600 -> 3602
            # (5 unchanged attributes hidden)
        }
    }

  # aws_cloudfront_distribution.site will be updated in-place
  ~ resource "aws_cloudfront_distribution" "site" {
        id                              = "E2T928B9V6ESU6"
        tags                            = {}
        # (24 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ compress                   = true -> false
            # (15 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "bruce-quotes-api"
      ~ reserved_concurrent_executions = -1 -> 50
        tags                           = {}
        # (30 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.page_generator will be updated in-place
  ~ resource "aws_lambda_function" "page_generator" {
        id                             = "bruce-quotes-page-generator"
      ~ reserved_concurrent_executions = -1 -> 10
        tags                           = {}
        # (30 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.site_cf will be updated in-place
  ~ resource "aws_s3_bucket_policy" "site_cf" {
        id     = "bruce-quotes-site-4839a64f"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::628639830692:distribution/E2T928B9V6ESU6"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::bruce-quotes-site-4839a64f/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @thekbb, Action: `pull_request`*